~~Адресное пространство:
LAN1: 10.10.1.0/24
LAN2: 10.10.2.0/24
LAN3: 10.10.3.0/24

~~Router 1

R1#conf t 
R1(config)#interface FastEthernet 0/0
R1(config-if)#ip address 10.10.1.3 255.255.255.0

R1#conf t
R1(config)#interface FastEthernet 2/0 
R1(config-if)#ip address 10.10.2.3 255.255.255.0

R1#conf t 
R1(config)#interface FastEthernet 1/0 
R1(config-if)#ip address 10.10.3.3 255.255.255.0

R1#wr mem

R1#show ip interface brief 
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.10.1.3       YES manual administratively down down    
FastEthernet1/0            10.10.3.3       YES manual administratively down down    
FastEthernet2/0            10.10.2.3       YES manual administratively down down    

~~Статическая маршрутизация

R1#conf t
R1(config)#ip route 10.10.3.0 255.255.255.0 10.10.3.2 
R1#wr mem

R1#conf t              
R1(config)#interface FastEthernet 1/0
R1(config-if)#no shutdown
R1#conf t 
R1(config)#interface FastEthernet 0/0
R1(config-if)#no shutdown
R1#conf t 
R1(config)#interface FastEthernet 2/0
R1(config-if)#no shutdown

R1#conf t
R1(config)#interface FastEthernet 0/0
R1(config-if)#ip helper-address 10.10.3.2

R1#conf t
R1(config)#interface FastEthernet 2/0
R1(config-if)#ip helper-address 10.10.3.2



~~Router 2 

R2#conf t 
R2(config)#interface FastEthernet 0/0
R2(config-if)#ip add
R2(config-if)#ip address 10.10.3.2 255.255.255.0

R2#wr mem

R2#show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.10.3.2       YES manual administratively down down  

~~DHCP LAN1
R2#conf t
R2(config)#ip dhcp pool LAN1 
R2(config)#ip dhcp excluded-address 10.10.1.3                       
R2(dhcp-config)#network 10.10.1.0 255.255.255.0
R2(dhcp-config)#defa
R2(dhcp-config)#default-router 10.10.1.3
R2(dhcp-config)#dns-
R2(dhcp-config)#dns-server 10.10.1.3
R2(dhcp-config)#lease 15 


~~DHCP LAN2
R2#conf t 
R2(config)#ip dhcp pool LAN2    
R2(config)#ip dhcp excluded-address 10.10.2.3                            
R2(dhcp-config)#network 10.10.2.0 255.255.255.0
R2(dhcp-config)#def
R2(dhcp-config)#default-router 10.10.2.3
R2(dhcp-config)#dns
R2(dhcp-config)#dns-server 10.10.2.3
R2(dhcp-config)#lease 15
  
R2#wr mem

~~Статическая маршрутизация

R2#conf t 
R2(config)#ip route 10.10.1.0 255.255.255.0 10.10.3.3 
R2(config)#ip route 10.10.2.0 255.255.255.0 10.10.3.3 
R2#wr mem

R2#conf t 
R2(config)#interface FastEthernet 0/0
R2(config-if)#no shutdown

R2#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/24 is subnetted, 3 subnets
S       10.10.1.0 [1/0] via 10.10.3.3
S       10.10.2.0 [1/0] via 10.10.3.3
C       10.10.3.0 is directly connected, FastEthernet0/0



~~Проверка ping

R1#ping 10.10.3.2     

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.10.3.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 60/61/64 ms

R2#ping 10.10.3.3

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.10.3.3, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 56/60/68 ms



